docs/tags/prayer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tagged: Prayer</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Tagged: Prayer</h1>
<ul class="org-ul">
<li><a href="../posts/2015-01-13-a-prayer-for-wellness.html">A Prayer for Wellness</a></li>
<li><a href="../posts/2015-01-13-christ-the-king-sunday.html">Christ the King Sunday</a></li>
<li><a href="../posts/2015-01-13-epiphany-sunday.html">Epiphany Sunday</a></li>
<li><a href="../posts/2015-01-13-for-those-who-help-us-grow.html">For Those Who Help Us Grow</a></li>
<li><a href="../posts/2015-01-13-fourth-sunday-of-advent.html">Fourth Sunday of Advent</a></li>
<li><a href="../posts/2015-01-13-good-friday.html">Good Friday</a></li>
<li><a href="../posts/2015-01-13-holy-saturday.html">Holy Saturday</a></li>
<li><a href="../posts/2015-01-13-holy-week.html">Holy Week</a></li>
<li><a href="../posts/2015-01-13-immersed-in-love.html">Immersed in Love</a></li>
<li><a href="../posts/2015-01-13-love-and-attention.html">Love and Attention</a></li>
<li><a href="../posts/2015-01-13-maundy-thursday.html">Maundy Thursday</a></li>
<li><a href="../posts/2015-01-13-memorial-day-prayer.html">Memorial Day Prayer</a></li>
<li><a href="../posts/2015-01-13-prayer-for-compassion.html">Prayer for Compassion</a></li>
<li><a href="../posts/2015-01-13-prayer-for-easter.html">Prayer for Easter</a></li>
<li><a href="../posts/2015-01-13-prayer-for-the-medicated-preacher.html">Prayer for the Medicated Preacher</a></li>
<li><a href="../posts/2015-01-13-thanksgiving-day-prayer.html">Thanksgiving Day Prayer</a></li>
<li><a href="../posts/2015-01-13-the-eighteenth-sunday-after-pentecost.html">The Eighteenth Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-the-eleventh-sunday-after-pentecost.html">The Eleventh Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-the-fifteenth-sunday-after-pentecost.html">The Fifteenth Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-the-fifth-sunday-after-pentecost.html">The Fifth Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-the-fifth-sunday-of-lent.html">the Fifth Sunday of Lent</a></li>
<li><a href="../posts/2015-01-13-the-fourteenth-sunday-after-pentecost.html">The Fourteenth Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-the-fourth-sunday-after-pentecost.html">the Fourth Sunday after Pentecost</a></li>
<li><a href="../posts/2015-01-13-the-fourth-sunday-of-easter.html">The Fourth Sunday of Easter</a></li>
<li><a href="../posts/2015-01-13-the-nineteenth-sunday-after-pentecost.html">The Nineteenth Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-the-ninth-sunday-after-pentecost.html">The Ninth Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-the-second-sunday-of-easter.html">The Second Sunday of Easter</a></li>
<li><a href="../posts/2015-01-13-the-seventeenth-sunday-after-pentecost.html">The Seventeenth Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-the-seventh-sunday-after-pentecost.html">The Seventh Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-the-sixteenth-sunday-after-pentecost.html">The Sixteenth Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-the-tenth-sunday-after-pentecost.html">The Tenth Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-the-third-sunday-of-easter.html">The Third Sunday of Easter</a></li>
<li><a href="../posts/2015-01-13-the-thirteenth-sunday-after-pentecost.html">The Thirteenth Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-the-twelfth-sunday-after-pentecost.html">The Twelfth Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-the-twentieth-sunday-after-pentecost.html">The Twentieth Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-third-sunday-of-advent.html">Third Sunday of Advent</a></li>
<li><a href="../posts/2015-01-20-christmas-prayer.html">Christmas Prayer</a></li>
<li><a href="../posts/2015-01-20-praying-for-enemies.html">Praying for Enemies</a></li>
<li><a href="../posts/2015-01-27-prayer-for-resolutions.html">Prayer for Resolutions</a></li>
<li><a href="../posts/2018-08-07-benediction-2.html">Benediction</a></li>
<li><a href="../posts/2015-01-13-the-third-sunday-after-pentecost.html">The Third Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-twenty-first-sunday-after-pentecost.html">Twenty-First Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-twenty-second-sunday-after-pentecost.html">Twenty-Second Sunday After Pentecost</a></li>
<li><a href="../posts/2015-01-13-twenty-third-sunday-after-pentecost.html">Twenty-Third Sunday After Pentecost</a></li>
<li><a href="../posts/2015-02-03-prayer-for-epiphany-4.html">Prayer for Epiphany 4</a></li>
<li><a href="../posts/2015-02-11-prayer-for-a-life-that-affirms.html">Prayer for a Life that Affirms</a></li>
<li><a href="../posts/2015-02-15-transfiguration-sunday-prayer.html">Transfiguration Sunday Prayer</a></li>
<li><a href="../posts/2015-02-18-ash-wednesday-prayer.html">Ash Wednesday Prayer</a></li>
<li><a href="../posts/2015-02-24-lent-1-prayer.html">Prayer for Lent 1</a></li>
<li><a href="../posts/2015-03-03-prayer-for-lent-2.html">Prayer for Lent 2</a></li>
<li><a href="../posts/2015-03-09-prayer-for-lent-3.html">Prayer for Lent 3</a></li>
<li><a href="../posts/2015-03-16-prayer-for-lent-4.html">Prayer for Lent 4</a></li>
<li><a href="../posts/2015-03-26-prayer-for-lent-5.html">Prayer for Lent 5</a></li>
<li><a href="../posts/2015-03-30-palm-sunday-2015.html">Palm Sunday 2015</a></li>
<li><a href="../posts/2015-04-02-maundy-thursday-2015.html">Maundy Thursday 2015</a></li>
<li><a href="../posts/2015-04-03-good-friday-prayer.html">Good Friday Prayer</a></li>
<li><a href="../posts/2015-04-04-prayer-for-holy-saturday.html">Prayer for Holy Saturday</a></li>
<li><a href="../posts/2015-04-05-easter-prayer.html">Easter Prayer</a></li>
<li><a href="../posts/2015-04-27-prayer-for-silence.html">Prayer for Silence</a></li>
<li><a href="../posts/2015-04-29-prayer-for-justice.html">Prayer for Justice</a></li>
<li><a href="../posts/2015-05-08-unexpected-grace.html">Unexpected Grace</a></li>
<li><a href="../posts/2015-05-10-prayer-for-mothers-day.html">Prayer for Mothers Day</a></li>
<li><a href="../posts/2015-06-01-prayer-for-trinity-sunday.html">Prayer for Trinity Sunday</a></li>
<li><a href="../posts/2015-06-11-prayer-for-our-stories.html">Lives are Stories — A Prayer</a></li>
<li><a href="../posts/2015-06-16-our-lives-as-art.html">Our Lives as Art</a></li>
<li><a href="../posts/2015-06-21-the-vanity-of-our-hope.html">The Vanity of Our Hope</a></li>
<li><a href="../posts/2015-07-05-between-love-and-hate.html">Between Love and Hate</a></li>
<li><a href="../posts/2015-07-07-religious-liberty-sunday-2015.html">Religious Liberty Sunday, 2015</a></li>
<li><a href="../posts/2015-07-12-prayer-for-the-kingdom.html">Prayer for the Kingdom</a></li>
<li><a href="../posts/2015-09-07-2015-09-06-called-church-prayer.html">Hiding in Gods Own Sanctuary</a></li>
<li><a href="../posts/2015-09-18-the-planted-church.html">The Planted Church</a></li>
<li><a href="../posts/2015-09-25-the-perfect-church.html">The Perfect Church</a></li>
<li><a href="../posts/2015-10-04-gun-violence--a-prayer.html">Gun Violence — A Prayer</a></li>
<li><a href="../posts/2015-10-11-prayer-for-a-unified-church.html">Prayer for a Unified Church</a></li>
<li><a href="../posts/2015-10-19-for-the-moments-of-darkness.html">For the Moments of Darkness</a></li>
<li><a href="../posts/2015-10-30-reformation-day-prayer.html">Reformation Day Prayer</a></li>
<li><a href="../posts/2015-11-03-prayer-for-allsaints-day.html">Prayer for All Saints Day</a></li>
<li><a href="../posts/2015-11-09-to-dance-without-care.html">To Dance Without Care</a></li>
<li><a href="../posts/2015-11-15-a-prayerful-response.html">A Prayerful Response</a></li>
<li><a href="../posts/2015-11-22-prayer-for-my-pettiness.html">Prayer for My Pettiness</a></li>
<li><a href="../posts/2015-11-26-thanksgiving-prayer.html">Thanksgiving Prayer</a></li>
<li><a href="../posts/2015-11-29-prayer-of-hope.html">Prayer of Hope</a></li>
<li><a href="../posts/2015-12-10-the-idol-of-security.html">The Idol of Security</a></li>
<li><a href="../posts/2015-12-16-prayer-for-the-joy-of-advent.html">Prayer for the Joy of Advent</a></li>
<li><a href="../posts/2015-12-22-prayer-for-the-fourth-sunday-of-advent.html">Prayer for the Fourth Sunday of Advent</a></li>
<li><a href="../posts/2016-01-02-prayer-for-the-new-year.html">Prayer for the New Year</a></li>
<li><a href="../posts/2016-01-06-prayer-before-travelling.html">Prayer Before Traveling</a></li>
<li><a href="../posts/2016-01-30-dancing-before-god.html">Dancing Before God</a></li>
<li><a href="../posts/2016-01-30-gifts-both-great-and-small.html">Gifts Both Great and Small</a></li>
<li><a href="../posts/2016-01-30-strength-and-wisdom.html">Strength and Wisdom</a></li>
<li><a href="../posts/2016-02-01-outside-the-beautiful-gate.html">Outside the Beautiful Gate</a></li>
<li><a href="../posts/2016-02-10-prayer-for-ash-wednesday.html">Prayer for Ash Wednesday</a></li>
<li><a href="../posts/2016-02-14-prayer-for-new-life.html">Prayer for New Life</a></li>
<li><a href="../posts/2016-02-22-truth-beauty-and-peace.html">Truth, Beauty, and Peace</a></li>
<li><a href="../posts/2016-02-28-prayer-for-the-desert.html">Prayer for the Desert</a></li>
<li><a href="../posts/2016-03-07-faith-and-power.html">Faith and Power</a></li>
<li><a href="../posts/2016-03-13-rejecting-exclusion.html">Rejecting Exclusion</a></li>
<li><a href="../posts/2016-03-20-prayer-for-palm-sunday.html">Prayer for Palm Sunday</a></li>
<li><a href="../posts/2016-03-24-prayer-for-maundy-thursday.html">Prayer for Maundy Thursday</a></li>
<li><a href="../posts/2016-03-25-prayer-for-good-friday.html">Prayer for Good Friday</a></li>
<li><a href="../posts/2016-03-26-holy-saturday.html">Holy Saturday</a></li>
<li><a href="../posts/2016-03-29-thomas-the-faithful.html">Thomas the Faithful</a></li>
<li><a href="../posts/2016-04-03-a-baptism-prayer.html">A Baptism Prayer</a></li>
<li><a href="../posts/2016-04-13-the-fear-of-risk.html">The Fear of Risk</a></li>
<li><a href="../posts/2016-04-24-prayer-for-a-busy-week.html">Prayer for a Busy Week</a></li>
<li><a href="../posts/2016-04-26-rejecting-labels.html">For Those Who Are Labeled</a></li>
<li><a href="../posts/2016-05-03-prayer-for-freedom.html">Prayer for Freedom</a></li>
<li><a href="../posts/2016-05-08-a-mothers-day-prayer.html">A Mothers Day Prayer</a></li>
<li><a href="../posts/2016-05-15-prayer-for-pentecost.html">Prayer for Pentecost</a></li>
<li><a href="../posts/2016-05-23-prayer-for-our-fears.html">Prayer for Our Fears</a></li>
<li><a href="../posts/2016-06-06-teach-me-to-sing.html">Teach Me to Sing</a></li>
<li><a href="../posts/2016-06-12-prayer-for-orlando.html">Prayer for Orlando</a></li>
<li><a href="../posts/2016-06-29-to-love-people-as-they-are.html">To Love People As They Are</a></li>
<li><a href="../posts/2016-07-09-prayer-for-the-nation.html">Prayer for the Nation</a></li>
<li><a href="../posts/2016-07-19-prayer-after-a-tragic-week.html">Prayer After a Tragic Week</a></li>
<li><a href="../posts/2016-08-07-a-wedding-prayer-and-blessing.html">A Wedding Prayer and Blessing</a></li>
<li><a href="../posts/2016-08-12-a-funeral-benediction.html">A Funeral Benediction</a></li>
<li><a href="../posts/2016-08-19-let-me-be-known.html">Let Me Be Known</a></li>
<li><a href="../posts/2016-08-27-a-prayer-of-thanks-for-friends.html">A Prayer of Thanks for Friends</a></li>
<li><a href="../posts/2016-09-06-benediction-for-22-shenanigans.html">Benediction for 22 Shenanigans</a></li>
<li><a href="../posts/2016-09-17-friends-in-the-darkness.html">Friends in the Darkness</a></li>
<li><a href="../posts/2016-09-27-the-eyes-of-faith.html">The Eyes of Faith</a></li>
<li><a href="../posts/2016-10-12-planting-a-tree.html">Planting a Tree</a></li>
<li><a href="../posts/2016-10-23-the-silent-jesus.html">The Silent Jesus</a></li>
<li><a href="../posts/2016-11-03-prayer-before-the-election.html">Prayer Before the Election</a></li>
<li><a href="../posts/2016-11-06-prayer-for-all-saints-day.html">Prayer for All Saints Day</a></li>
<li><a href="../posts/2016-11-10-love-one-another.html">After the Election — Love</a></li>
<li><a href="../posts/2016-11-12-prayer-of-st-thomas.html">Prayer of St. Thomas</a></li>
<li><a href="../posts/2016-11-13-hands-that-crucify.html">Hands that Crucify</a></li>
<li><a href="../posts/2016-11-24-gratitude-over-despair.html">Gratitude Over Despair</a></li>
<li><a href="../posts/2016-12-02-prayer-of-hope.html">Prayer of Hope</a></li>
<li><a href="../posts/2016-12-08-the-frailty-of-love.html">The Frailty of Love</a></li>
<li><a href="../posts/2016-12-13-the-offensive-jesus.html">The Offensive Jesus</a></li>
<li><a href="../posts/2016-12-20-prayer-for-avent-4.html">Prayer for Advent 4</a></li>
<li><a href="../posts/2016-12-25-christmas-prayer.html">Christmas Prayer</a></li>
<li><a href="../posts/2016-12-28-walls.html">Walls</a></li>
<li><a href="../posts/2017-01-03-prayer-for-the-new-year.html">Prayer for the New Year</a></li>
<li><a href="../posts/2017-01-12-the-sin-of-ambivalence.html">The Sin of Ambivalence</a></li>
<li><a href="../posts/2017-01-15-prayer-in-times-of-change.html">Prayer in Times of Change</a></li>
<li><a href="../posts/2017-01-21-prayer-for-the-fight.html">Prayer for the Fight</a></li>
<li><a href="../posts/2017-01-30-political-engagement--a-prayer.html">Political Engagement — a Prayer</a></li>
<li><a href="../posts/2017-02-09-prayer-for-the-silenced.html">Prayer for the Silenced</a></li>
<li><a href="../posts/2017-02-23-give-me-words-of-grace.html">Give Me Words of Grace</a></li>
<li><a href="../posts/2017-03-01-prayer-for-ash-wednesday.html">Prayer for Ash Wednesday</a></li>
<li><a href="../posts/2017-03-19-who-is-my-god.html">Who Is My God?</a></li>
<li><a href="../posts/2017-03-27-the-lamb-of-god.html">The Lamb of God</a></li>
<li><a href="../posts/2017-04-03-the-betrayer.html">The Betrayer</a></li>
<li><a href="../posts/2017-04-08-prayer-for-palm-sunday.html">Prayer for Palm Sunday</a></li>
<li><a href="../posts/2017-04-14-prayer-for-good-friday.html">Prayer for Good Friday</a></li>
<li><a href="../posts/2017-04-15-prayer-for-holy-saturday.html">Prayer for Holy Saturday</a></li>
<li><a href="../posts/2017-04-16-prayer-for-easter.html">Prayer for Easter</a></li>
<li><a href="../posts/2017-05-16-prayer-for-finals-week.html">Prayer for Finals Week</a></li>
<li><a href="../posts/2017-06-03-pentecost-prayer.html">Pentecost Prayer</a></li>
<li><a href="../posts/2017-07-04-prayer-to-see-what-could-be.html">Prayer to See What Could Be</a></li>
<li><a href="../posts/2017-08-09-prayer-for-graceful-words.html">Prayer for Graceful Words</a></li>
<li><a href="../posts/2017-08-17-a-new-school-year.html">A New School Year</a></li>
<li><a href="../posts/2017-09-04-a-prayer-for-my-failing-faith.html">A Prayer for My Failing Faith</a></li>
<li><a href="../posts/2017-09-12-be-the-body-of-christ.html">Be the Body of Christ</a></li>
<li><a href="../posts/2017-09-24-on-passing-judgment.html">On Passing Judgment</a></li>
<li><a href="../posts/2017-09-30-in-offense-giving-thanks.html">In Offense, Giving Thanks</a></li>
<li><a href="../posts/2017-10-03-do-not-be-daunted.html">Do Not Be Daunted</a></li>
<li><a href="../posts/2017-10-12-the-burden-of-freedom.html">The Burden of Freedom</a></li>
<li><a href="../posts/2017-10-24-when-the-idols-are-destroyed.html">When the Idols are Destroyed</a></li>
<li><a href="../posts/2017-12-09-ordination-prayer.html">Ordination Prayer</a></li>
<li><a href="../posts/2017-12-24-prayer-for-the-fourth-sunday-of-advent.html">Prayer for the Fourth Sunday of Advent</a></li>
<li><a href="../posts/2018-02-19-prayer-in-times-of-fear.html">Prayer in Times of Fear</a></li>
<li><a href="../posts/2018-02-20-benediction.html">Benediction</a></li>
<li><a href="../posts/2018-09-03-prayer-for-labor-day.html">Prayer for Labor Day</a></li>
<li><a href="../posts/2018-11-04-prayer-for-pittsburgh.html">Prayer for Pittsburgh</a></li>
<li><a href="../posts/2016-06-22-prayer-for-the-twentytwo.html">Prayer for the Twenty-Two</a></li>
<li><a href="../posts/2015-04-15-dostoevsky-suffering-and-the-prayer-for-the-week.html">Dostoevsky, Suffering, and the Prayer for the Week</a></li>
<li><a href="../posts/2017-11-19-prayer-for-times-of-grief.html">Prayer for Times of Grief</a></li>
<li><a href="../posts/2018-12-10-finals-week.html">Finals Week</a></li>
<li><a href="../posts/2010-11-03-a-life-in-prayer-is-a-life-in-open-hands-where-you.html">Perfection in Weakness</a></li>
<li><a href="../posts/2010-12-01-on-not-understanding-prayer.html">On Not Understanding Prayer</a></li>
<li><a href="../posts/2015-05-14-prayer-for-an-isolated-people.html">Prayer for an Isolated People</a></li>
<li><a href="../posts/2015-05-24-prayer-for-memorial-day-2015.html">Prayer for Memorial Day, 2015</a></li>
</ul>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
